#pragma once
#include "Logic.h"
#include <string>

namespace data_a
{

		//Analiz a1(string("Анализ"), string("крови"), 111, 444,15);
		//Analiz a2(string("Анализ"), string("желез"), 123, 345, 30);
		//Analiz a3(string("Анализ"), string("мочи"), 123, 345, 30);

		//Analiz a3(string("Анализ"), "мочи"); 
		Analiz a1(string("Анализ"), string("крови"), 111, 444, 15,100);
		Analiz a2(string("Анализ"), string("желез"), 123, 345, 30, 100);
		Analiz a3(string("Анализ"), string("мочи"), 123, 345, 30, 100);
		Analiz a4(string("Анализ"), string("кала"), 100, 500, 10,100);
		Analiz a5(string("Анализ"), string("секреции"),100, 500, 15, 100);
		Analiz a6(string("УЗИ"), string("Органов_брюшной_полости"), 100, 500, 30, 150);
		Analiz a7(string("УЗИ"), string("мочевыводящей_системы"), 100, 500, 40, 150);
		Analiz a8(string("УЗИ"), string("половой системы"), 100, 500, 40, 150);
		Analiz a9(string("УЗИ"), string("щитовидной_железы"), 100, 500, 40, 150);
		Analiz a10(string("УЗИ"), string("молочной_железы"), 100, 500, 40, 150);
		Analiz a11(string("УЗИ"), string("лимфоузлов"), 100, 500, 40, 150);
		Analiz a12(string("УЗИ"), string("суставов"), 100, 500, 40, 150);
		Analiz a13(string("УЗИ"), string("тазобедренных"), 100, 500, 40, 150);
		Analiz a14(string("Рентген"), string("грудной_клетки"), 100, 500, 40, 300);
		Analiz a15(string("Рентген"), string("костей_рук_и_ног"), 100, 500, 40, 300);
		Analiz a16(string("Рентген"), string("черепа"), 100, 500, 40, 300);
		Analiz a17(string("Рентген"), string("позвоночника"), 100, 500, 40, 300);
		Analiz a18(string("Кардиограмма"), string("сердца"), 100, 500, 40, 340);
		Analiz a19(string("Маммография"), string("сиски"), 100, 500, 40, 350);
		Analiz a20(string("Эндоскопия"), string("Гастроскопия"), 100, 500, 40, 350);
		Analiz a21(string("Эндоскопия"), string("Колоноскопия"), 100, 500, 40, 350);
		Analiz a22(string("Эндоскопия"), string("Бронхоскопия"), 100, 500, 40, 350);
		
		
		Analiz arr_a[22] = { a1, a2, a3, a4, a5, a6, a7, a8, a9, a10,a11, a12, a13, a14, a15, a16, a17, a18, a19, a20, a21, a22};
		int arr_a_size = 22;
}
namespace data_d
{
	Doctor d1("Терапевт ", "Масюкин", 100, 500, 10, 100);
	Doctor d2("Терапевт ", "Грыжин", 100, 500, 10, 100);
	Doctor d3("Терапевт ", "Папова", 100, 500, 10, 100);
	Doctor d4("Терапевт ", "Оскалипова", 100, 500, 10, 100);
	Doctor d5("Стоматолог", "Зубкина", 100, 500, 10, 100);
	Doctor d6("Стоматолог", "Вырвин", 100, 500, 10, 100);
	Doctor d7("ЛОР ", "Носов", 100, 500, 10, 100);
	Doctor d8("ЛОР ", "Ухина", 100, 500, 10, 100);
	Doctor d9("Аллерголог ", "Апхи", 100, 500, 10, 100);
	Doctor d10("Аллерголог ", "Хаптьфу", 100, 500, 10, 100);
	Doctor d11("Аллерголог ", "Будздоровянеболен", 100, 500, 10, 100);
	Doctor d12("Хирург ", "Ломоносов", 100, 500, 10, 100);
	Doctor d13("Травмотолог ", "Сломалмозг", 100, 500, 10, 100);
	Doctor d14("Травмотолог ", "Вывихина", 100, 500, 10, 100);

	Doctor d15("Физиолог ", "Сниматеобувкин", 100, 500, 10, 100);

	Doctor d16("Уролог ", "Пискин", 100, 500, 10, 100);

	Doctor d17("Проктолог ", "Попкина", 100, 500, 10, 100);

	Doctor d18("Дерматолог ", "Кожинков", 100, 500, 10, 100);
	Doctor d19("Дерматолог ", "Кожевяткин", 100, 500, 10, 100);

	Doctor arr_d[19] = {d1, d2, d3, d4, d5, d6, d7, d8, d9, d10, d11, d12, d13, d14, d15, d16, d17, d18, d19 };
	int arr_d_size = 19;
}